# IsHomeCameraSet Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ViewNavigationToolSettings..::..IsHomeCameraSet Method
ViewNavigationToolSettings Class See Also
---
Checks if the home view is set in the settings.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public bool IsHomeCameraSet()
```

Visual Basic
---
```text
Public Function IsHomeCameraSet As Boolean
```

Visual C++
---
```text
public:
bool IsHomeCameraSet()
```

# ### Return Value
Returns true if home view is set, otherwise false.
# See Also
ViewNavigationToolSettings Class
Autodesk.Revit.DB Namespace